_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ГруппыРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_ГруппыРесурсов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ГодыВыпускаБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ГодыВыпускаБазы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>г1984</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г1991</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г2001</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г2009</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г2017</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ГруппыРесурсов/Ext/ManagerModule.bsl
#Область СлужебныеПроцедуры

// В зависимости от СметноНормативнойБазы возвращает группу ресурсов.
//
// Параметры:
// 		СНБ - СправочникСсылка.СМ_СметноНормативныеБазы - содержит ссылку на нормативную базу.
//
Функция ЗаполнитьГруппуРесурсовПоУмолчанию(СНБ) Экспорт
	
	Если СНБ.Код = "TS" Тогда
		Возврат Справочники.СМ_ГруппыРесурсов.КаталогТСН;
	ИначеЕсли СНБ.Код = "PG" Тогда
		Возврат Справочники.СМ_ГруппыРесурсов.КаталогГазпром;
	ИначеЕсли СНБ.Код = "RK" Тогда
		Возврат Справочники.СМ_ГруппыРесурсов.КаталогРК;
	ИначеЕсли СНБ.ГодВыпуска = Перечисления.СМ_ГодыВыпускаБазы.г1984 Тогда
		Возврат Справочники.СМ_ГруппыРесурсов.Каталог1984;
	ИначеЕсли СНБ.ГодВыпуска = Перечисления.СМ_ГодыВыпускаБазы.г2017 Тогда
		Возврат Справочники.СМ_ГруппыРесурсов.Каталог2017;
	Иначе 
		Возврат Справочники.СМ_ГруппыРесурсов.Каталог2001;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
